Revit 2027 API
PipingSystem.IsHydraulicLoopBoundary Method
 Checks if the element is a valid hydraulic loop boundary.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsHydraulicLoopBoundary(
	Element element
)
Public Shared Function IsHydraulicLoopBoundary (
	element As Element
) As Boolean
public:
static bool IsHydraulicLoopBoundary(
	Element^ element
)
static member IsHydraulicLoopBoundary :
        element : Element -> bool
Parameters
element Element
 The element to be checked.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace